#+STARTUP: showall indent
#+PROPERTY: header-args:sql :engine mysql :dbhost 127.0.0.1 :dbuser root :dbpassword test

* Basics

- [[https://qiita.com/tatsuya4150/items/69c2c9d318e5b93e6ccd][【これだけ覚えてたらOK！】SQL構文まとめ - Qiita]] 

- SHOW
  - =SHOW DATABASE;= =\l=
  - =SHOW TABLES;= =\d=

- USE
  - =USE db_name;= =\c db_name=
    
- CREATE
  - =CREATE DATABASE db_name;=
  - =CREATE table_name (id SERIAL PRIMARY KEY, body VARCHAR(255));=

- DROP
  - =DROP DATABASE db_name;=
  - =DROP TABLE table_name;=

- TRUNCATE (テーブルを空にする)
  - =TRUNCATE TABLE table_nmae;=

- ALTER
  - =ALTER TABLE table_name1 RENAME TO table_name2;=
  - =ALTER TABLE table_name ADD PRIMARY KEY(id);= (主キーを追加)
  - =ALTER TABLE table_name DROP CONSTRAINT "table_name + _pkey";= (主キーを削除)

- [[*INSERT][INSERT]] 
  - =INSERT INTO table_name VALUES ("foo", "bar", "baz");=
  - =INSERT INTO table_name (col1, col2) VALUES ("val1", "val2");=

- [[*UPDATE][UPDATE]]
  - =UPDATE tables_name SET col_name1 = value1, col_name2 = value2 WHERE id = 1;=

- [[*DELETE][DELETE]] 
  - =DELETE FROM table_name WHERE id = 1;=

- [[*SELECT][SELECT]] 
  - =SELECT * FROM table_name;=

* DATABASES
** PostgreSQL
** MySQL

#+begin_src sql
show databases;
#+end_src

#+RESULTS:
| Database           |
|--------------------|
| information_schema |
| mysql              |
| performance_schema |
| sys                |

- テスト用のデータベースを作成
#+begin_src sql
create database testdb;
show databases;
#+end_src

#+RESULTS:
| Database           |
|--------------------|
| information_schema |
| mysql              |
| performance_schema |
| sys                |
| testdb             |

* TABLES
** SHOW TABLES

#+begin_src sql
use mysql;
show tables;
#+end_src

#+RESULTS:
| Tables_in_mysql           |
|---------------------------|
| columns_priv              |
| component                 |
| db                        |
| default_roles             |
| engine_cost               |
| func                      |
| general_log               |
| global_grants             |
| gtid_executed             |
| help_category             |
| help_keyword              |
| help_relation             |
| help_topic                |
| innodb_index_stats        |
| innodb_table_stats        |
| password_history          |
| plugin                    |
| procs_priv                |
| proxies_priv              |
| role_edges                |
| server_cost               |
| servers                   |
| slave_master_info         |
| slave_relay_log_info      |
| slave_worker_info         |
| slow_log                  |
| tables_priv               |
| time_zone                 |
| time_zone_leap_second     |
| time_zone_name            |
| time_zone_transition      |
| time_zone_transition_type |
| user                      |

** CREATE TABLE

#+begin_src sql :database testdb
drop table if exists todos;
create table `todos` (
  `id` INT(10) NOT NULL AUTO_INCREMENT,
  `title` VARCHAR(100) NOT NULL,
  `status` INT(1) DEFAULT '0',
  `created` TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated` TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
#+end_src

#+begin_src sql :database testdb
SELECT * FROM todos;
#+end_src

* INSERT

#+begin_src sql :database testdb
INSERT INTO todos (title, status) VALUES ("買い物", 1);
INSERT INTO todos (title, status) VALUES ("料理", 0);
INSERT INTO todos (title, status) VALUES ("粗大ゴミ", 0);
#+end_src

* SELECT
** Basics

- AND/OR
  - =SELECT * FROM table_name WHERE cond1 AND cond2;=
  - =SELECT * FROM table_name WHERE cond1 OR cond2;=

- 比較演算子 (一般的なものが利用可能. != は <> が使われる)
  - =SELECT * FROM table_name WHERE price > 1000;=

- NULL Check
  - =SELECT * FROM table_name WHERE col_name IS NULL;=
  - =SELECT * FROM table_name WHERE col_name IS NOT NULL;=

- LIKE 
  - =SELECT * FROM table_name WHERE col_name LIKE '%1月%';=
  - =SELECT * FROM table_name WHERE col_name LIKE '1月_';=
  - =%=: 任意の 0 文字以上の文字列
  - =_=: 任意の 1 文字

- BETWEEN
  - =SELECT * FROM table_name WHERE price BETWEEN 1000 AND 3000;=

- IN/NOT IN
  - =SELECT * FROM table_name WHERE col_name IN (value1, value2, value3);=
  - =SELECT * FROM table_name WHERE col_name NOT IN (value1, value2, value3);=

- ANY/ALL
  - =SELECT * FROM table_name WHERE col_name =\equal< ANY (value1, value2, value3);=
  - =SELECT * FROM table_name WHERE col_name =\equal< ALL (value1, value2, value3);=

- DISTINCT
  - =SELECT DISTINCT col_name FROM table_name;=

- ORDER BY (ASC, DESC)
  - =SELECT * FROM table_name ORDER BY price DESC;=

- LIMIT (OFFSET は指定数 + 1 番目から抽出する)
  - =SELECT * FROM table_name ORDER BY price LIMIT 3 OFFSET 2;=

- 集合
  - =SELECT * FROM table_name1 UNION SELECT * FROM table_name2;= (和集合)
  - =SELECT * FROM table_name1 EXCEPT SELECT * FROM table_name2;= (差集合)
  - =SELECT * FROM table_name1 INTERSECT SELECT * FROM table_name2;= (積集合)

- CASE ~ WHEN ~ THEN ~ ELSE ~ END
#+begin_src sql
SELECT user_name,
       CASE age WHEN age < 20 THEN '未成年'
                WHEN 20 <= age AND age <= 65 THEN '成年'
                ELSE '高齢者'
       END AS category
  FROM table_name;
#+end_src

- 文字列
  - LENGTH (文字列の長さを返す)
    - =SELECT user_name, length(user_name) AS name_length FROM table_name;=
  - TRIM
    - =SELECT user_name, TRIM(user_name) as trimmed_user_name FROM table_name;=
  - REPLACE (指定文字列のマッチを置換)
    - =UPDATE table_name SET user_name = REPLACE(user_name, 'foo', 'bar');=
  - SUBSTRING
    - =SELECT * FROM table_name WHERE SUBSTRING(user_name, 1, 3) LIKE '%fo%';=

- 数値
  - ROUND
    - =SELECT price, ROUND(price, -2) as price_in_hundred FROM table_name;=
  - TRUNC
    - =SELECT price, TRUNC(price, 1) as trunced_price FROM table_name;=
  - POWER
    - =SELECT price, POWER(price, 2) as power2_price FROM table_name;=

- 日付
  - =INSERT INTO table_name VALUES (CURRENT_DATE, value1, value2);= (現在時刻を挿入)
  - =SELECT now();= (現在時刻)

- CAST
  - =SELECT CAST(price as VARCHAR(20)) + '円' AS price_yen FROM table_name;=

- 集約・グループ化
  - =SELECT SUM(price) as total_price FROM table_name;=
  - =SELECT COUNT(*) as total_trans FROM table_name;=
    - =COUNT(*)= は NULL 行含む合計行
    - =COUNT(col_name)= は NULL行を含まない合計行
  - =SELECT group, SUM(price) as total_price_by_group FROM table_name GROUP BY group;=

- サブクエリ (副問合せ)
  - クエリの中にクエリを書く
  - WITH, CTE (Common Table Expression)
    - サブクエリを外出しにして変数でアクセスする (ビューのイメージ)
    - 可読性が高い
    - 使い回しが可能
#+begin_src sql
WITH var_name AS (
  SELECT col_name FROM table_name1 WHERE cond
  )
SELECT * FROM table_name2 JOIN var_name
#+end_src
    
** testdb.todos table

#+begin_src sql :database testdb
SELECT * FROM todos;
#+end_src

#+RESULTS:
| id | title    | status | created             | updated             |
|----+----------+--------+---------------------+---------------------|
|  1 | 買い物   |      1 | 2020-05-06 14:52:33 | 2020-05-06 14:52:33 |
|  2 | 買い物   |      1 | 2020-05-06 14:53:09 | 2020-05-06 14:53:09 |
|  3 | 料理     |      0 | 2020-05-06 14:53:09 | 2020-05-06 14:53:09 |
|  4 | 粗大ゴミ |      0 | 2020-05-06 14:53:09 | 2020-05-06 14:53:09 |

- 完了していないタスク
#+begin_src sql :database testdb
SELECT * FROM todos WHERE status = 0;
#+end_src

#+RESULTS:
| id | title    | status | created             | updated             |
|----+----------+--------+---------------------+---------------------|
|  3 | 料理     |      0 | 2020-05-06 14:53:09 | 2020-05-06 14:53:09 |
|  4 | 粗大ゴミ |      0 | 2020-05-06 14:53:09 | 2020-05-06 14:53:09 |

** mysql.user database

- mysql.user table から抽出
#+begin_src sql :database mysql
select Host, User from user;
#+end_src

#+RESULTS:
| Host      | User             |
|-----------+------------------|
| %         | root             |
| localhost | mysql.infoschema |
| localhost | mysql.session    |
| localhost | mysql.sys        |
| localhost | root             |

- =\G= を末尾に付けると見易くなる
#+begin_src sql :database mysql
select * from user\G
#+end_src

#+RESULTS:
| *************************** 1. row ***************************                                          |
|-----------------------------------------------------------------------------------------------------|
| Host: %                                                                                             |
| User: root                                                                                          |
| Select_priv: Y                                                                                      |
| Insert_priv: Y                                                                                      |
| Update_priv: Y                                                                                      |
| Delete_priv: Y                                                                                      |
| Create_priv: Y                                                                                      |
| Drop_priv: Y                                                                                        |
| Reload_priv: Y                                                                                      |
| Shutdown_priv: Y                                                                                    |
| Process_priv: Y                                                                                     |
| File_priv: Y                                                                                        |
| Grant_priv: Y                                                                                       |
| References_priv: Y                                                                                  |
| Index_priv: Y                                                                                       |
| Alter_priv: Y                                                                                       |
| Show_db_priv: Y                                                                                     |
| Super_priv: Y                                                                                       |
| Create_tmp_table_priv: Y                                                                            |
| Lock_tables_priv: Y                                                                                 |
| Execute_priv: Y                                                                                     |
| Repl_slave_priv: Y                                                                                  |
| Repl_client_priv: Y                                                                                 |
| Create_view_priv: Y                                                                                 |
| Show_view_priv: Y                                                                                   |
| Create_routine_priv: Y                                                                              |
| Alter_routine_priv: Y                                                                               |
| Create_user_priv: Y                                                                                 |
| Event_priv: Y                                                                                       |
| Trigger_priv: Y                                                                                     |
| Create_tablespace_priv: Y                                                                           |
| ssl_type:                                                                                           |
| ssl_cipher:                                                                                         |
| x509_issuer:                                                                                        |
| x509_subject:                                                                                       |
| max_questions: 0                                                                                    |
| max_updates: 0                                                                                      |
| max_connections: 0                                                                                  |
| max_user_connections: 0                                                                             |
| plugin: caching_sha2_password                                                                       |
| authentication_string: $A$005$:d`.CGTmIQx:f*9BdrjpnzGIbHw5NdeoXB3RILdVTYE7Agu4VJ3x0HPO5 |
| password_expired: N                                                                                 |
| password_last_changed: 2020-05-06 13:59:08                                                          |
| password_lifetime: NULL                                                                             |
| account_locked: N                                                                                   |
| Create_role_priv: Y                                                                                 |
| Drop_role_priv: Y                                                                                   |
| Password_reuse_history: NULL                                                                        |
| Password_reuse_time: NULL                                                                           |
| Password_require_current: NULL                                                                      |
| User_attributes: NULL                                                                               |
| *************************** 2. row ***************************                                          |
| Host: localhost                                                                                     |
| User: mysql.infoschema                                                                              |
| Select_priv: Y                                                                                      |
| Insert_priv: N                                                                                      |
| Update_priv: N                                                                                      |
| Delete_priv: N                                                                                      |
| Create_priv: N                                                                                      |
| Drop_priv: N                                                                                        |
| Reload_priv: N                                                                                      |
| Shutdown_priv: N                                                                                    |
| Process_priv: N                                                                                     |
| File_priv: N                                                                                        |
| Grant_priv: N                                                                                       |
| References_priv: N                                                                                  |
| Index_priv: N                                                                                       |
| Alter_priv: N                                                                                       |
| Show_db_priv: N                                                                                     |
| Super_priv: N                                                                                       |
| Create_tmp_table_priv: N                                                                            |
| Lock_tables_priv: N                                                                                 |
| Execute_priv: N                                                                                     |
| Repl_slave_priv: N                                                                                  |
| Repl_client_priv: N                                                                                 |
| Create_view_priv: N                                                                                 |
| Show_view_priv: N                                                                                   |
| Create_routine_priv: N                                                                              |
| Alter_routine_priv: N                                                                               |
| Create_user_priv: N                                                                                 |
| Event_priv: N                                                                                       |
| Trigger_priv: N                                                                                     |
| Create_tablespace_priv: N                                                                           |
| ssl_type:                                                                                           |
| ssl_cipher:                                                                                         |
| x509_issuer:                                                                                        |
| x509_subject:                                                                                       |
| max_questions: 0                                                                                    |
| max_updates: 0                                                                                      |
| max_connections: 0                                                                                  |
| max_user_connections: 0                                                                             |
| plugin: caching_sha2_password                                                                       |
| authentication_string: $A$005$THISISACOMBINATIONOFINVALIDSALTANDPASSWORDTHATMUSTNEVERBRBEUSED       |
| password_expired: N                                                                                 |
| password_last_changed: 2020-05-06 13:59:04                                                          |
| password_lifetime: NULL                                                                             |
| account_locked: Y                                                                                   |
| Create_role_priv: N                                                                                 |
| Drop_role_priv: N                                                                                   |
| Password_reuse_history: NULL                                                                        |
| Password_reuse_time: NULL                                                                           |
| Password_require_current: NULL                                                                      |
| User_attributes: NULL                                                                               |
| *************************** 3. row ***************************                                          |
| Host: localhost                                                                                     |
| User: mysql.session                                                                                 |
| Select_priv: N                                                                                      |
| Insert_priv: N                                                                                      |
| Update_priv: N                                                                                      |
| Delete_priv: N                                                                                      |
| Create_priv: N                                                                                      |
| Drop_priv: N                                                                                        |
| Reload_priv: N                                                                                      |
| Shutdown_priv: Y                                                                                    |
| Process_priv: N                                                                                     |
| File_priv: N                                                                                        |
| Grant_priv: N                                                                                       |
| References_priv: N                                                                                  |
| Index_priv: N                                                                                       |
| Alter_priv: N                                                                                       |
| Show_db_priv: N                                                                                     |
| Super_priv: Y                                                                                       |
| Create_tmp_table_priv: N                                                                            |
| Lock_tables_priv: N                                                                                 |
| Execute_priv: N                                                                                     |
| Repl_slave_priv: N                                                                                  |
| Repl_client_priv: N                                                                                 |
| Create_view_priv: N                                                                                 |
| Show_view_priv: N                                                                                   |
| Create_routine_priv: N                                                                              |
| Alter_routine_priv: N                                                                               |
| Create_user_priv: N                                                                                 |
| Event_priv: N                                                                                       |
| Trigger_priv: N                                                                                     |
| Create_tablespace_priv: N                                                                           |
| ssl_type:                                                                                           |
| ssl_cipher:                                                                                         |
| x509_issuer:                                                                                        |
| x509_subject:                                                                                       |
| max_questions: 0                                                                                    |
| max_updates: 0                                                                                      |
| max_connections: 0                                                                                  |
| max_user_connections: 0                                                                             |
| plugin: caching_sha2_password                                                                       |
| authentication_string: $A$005$THISISACOMBINATIONOFINVALIDSALTANDPASSWORDTHATMUSTNEVERBRBEUSED       |
| password_expired: N                                                                                 |
| password_last_changed: 2020-05-06 13:59:04                                                          |
| password_lifetime: NULL                                                                             |
| account_locked: Y                                                                                   |
| Create_role_priv: N                                                                                 |
| Drop_role_priv: N                                                                                   |
| Password_reuse_history: NULL                                                                        |
| Password_reuse_time: NULL                                                                           |
| Password_require_current: NULL                                                                      |
| User_attributes: NULL                                                                               |
| *************************** 4. row ***************************                                          |
| Host: localhost                                                                                     |
| User: mysql.sys                                                                                     |
| Select_priv: N                                                                                      |
| Insert_priv: N                                                                                      |
| Update_priv: N                                                                                      |
| Delete_priv: N                                                                                      |
| Create_priv: N                                                                                      |
| Drop_priv: N                                                                                        |
| Reload_priv: N                                                                                      |
| Shutdown_priv: N                                                                                    |
| Process_priv: N                                                                                     |
| File_priv: N                                                                                        |
| Grant_priv: N                                                                                       |
| References_priv: N                                                                                  |
| Index_priv: N                                                                                       |
| Alter_priv: N                                                                                       |
| Show_db_priv: N                                                                                     |
| Super_priv: N                                                                                       |
| Create_tmp_table_priv: N                                                                            |
| Lock_tables_priv: N                                                                                 |
| Execute_priv: N                                                                                     |
| Repl_slave_priv: N                                                                                  |
| Repl_client_priv: N                                                                                 |
| Create_view_priv: N                                                                                 |
| Show_view_priv: N                                                                                   |
| Create_routine_priv: N                                                                              |
| Alter_routine_priv: N                                                                               |
| Create_user_priv: N                                                                                 |
| Event_priv: N                                                                                       |
| Trigger_priv: N                                                                                     |
| Create_tablespace_priv: N                                                                           |
| ssl_type:                                                                                           |
| ssl_cipher:                                                                                         |
| x509_issuer:                                                                                        |
| x509_subject:                                                                                       |
| max_questions: 0                                                                                    |
| max_updates: 0                                                                                      |
| max_connections: 0                                                                                  |
| max_user_connections: 0                                                                             |
| plugin: caching_sha2_password                                                                       |
| authentication_string: $A$005$THISISACOMBINATIONOFINVALIDSALTANDPASSWORDTHATMUSTNEVERBRBEUSED       |
| password_expired: N                                                                                 |
| password_last_changed: 2020-05-06 13:59:04                                                          |
| password_lifetime: NULL                                                                             |
| account_locked: Y                                                                                   |
| Create_role_priv: N                                                                                 |
| Drop_role_priv: N                                                                                   |
| Password_reuse_history: NULL                                                                        |
| Password_reuse_time: NULL                                                                           |
| Password_require_current: NULL                                                                      |
| User_attributes: NULL                                                                               |
| *************************** 5. row ***************************                                          |
| Host: localhost                                                                                     |
| User: root                                                                                          |
| Select_priv: Y                                                                                      |
| Insert_priv: Y                                                                                      |
| Update_priv: Y                                                                                      |
| Delete_priv: Y                                                                                      |
| Create_priv: Y                                                                                      |
| Drop_priv: Y                                                                                        |
| Reload_priv: Y                                                                                      |
| Shutdown_priv: Y                                                                                    |
| Process_priv: Y                                                                                     |
| File_priv: Y                                                                                        |
| Grant_priv: Y                                                                                       |
| References_priv: Y                                                                                  |
| Index_priv: Y                                                                                       |
| Alter_priv: Y                                                                                       |
| Show_db_priv: Y                                                                                     |
| Super_priv: Y                                                                                       |
| Create_tmp_table_priv: Y                                                                            |
| Lock_tables_priv: Y                                                                                 |
| Execute_priv: Y                                                                                     |
| Repl_slave_priv: Y                                                                                  |
| Repl_client_priv: Y                                                                                 |
| Create_view_priv: Y                                                                                 |
| Show_view_priv: Y                                                                                   |
| Create_routine_priv: Y                                                                              |
| Alter_routine_priv: Y                                                                               |
| Create_user_priv: Y                                                                                 |
| Event_priv: Y                                                                                       |
| Trigger_priv: Y                                                                                     |
| Create_tablespace_priv: Y                                                                           |
| ssl_type:                                                                                           |
| ssl_cipher:                                                                                         |
| x509_issuer:                                                                                        |
| x509_subject:                                                                                       |
| max_questions: 0                                                                                    |
| max_updates: 0                                                                                      |
| max_connections: 0                                                                                  |
| max_user_connections: 0                                                                             |
| plugin: caching_sha2_password                                                                       |
| authentication_string: $A$005$2Ya^75 %A                                               |
| S=}VxbGQ55ZN0wD8ekPDwPlZ06r3g2QpYNY0RIHbz2oPFA                                                      |
| password_expired: N                                                                                 |
| password_last_changed: 2020-05-06 13:59:08                                                          |
| password_lifetime: NULL                                                                             |
| account_locked: N                                                                                   |
| Create_role_priv: Y                                                                                 |
| Drop_role_priv: Y                                                                                   |
| Password_reuse_history: NULL                                                                        |
| Password_reuse_time: NULL                                                                           |
| Password_require_current: NULL                                                                      |
| User_attributes: NULL                                                                               |
* UPDATE

- 列を選択して更新
#+begin_src sql :database testdb
UPDATE todos SET status = 1 WHERE id = 2;
SELECT * FROM todos;
#+end_src

#+RESULTS:
| id | title    | status | created             | updated             |
|----+----------+--------+---------------------+---------------------|
|  1 | 買い物   |      1 | 2020-05-06 14:52:33 | 2020-05-06 14:52:33 |
|  2 | 買い物   |      1 | 2020-05-06 14:53:09 | 2020-05-06 14:53:09 |
|  3 | 料理     |      0 | 2020-05-06 14:53:09 | 2020-05-06 14:53:09 |
|  4 | 粗大ゴミ |      0 | 2020-05-06 14:53:09 | 2020-05-06 14:53:09 |

* DELETE

- =WHERE id = 2= を忘れてしまうと全行が削除されてしまう。
- 最初に SELECT で WHERE 句に間違いがないか確認してからの方が吉
#+begin_src sql :database testdb
DELETE FROM todos WHERE id = 2;
SELECT * FROM todos;
#+end_src

#+RESULTS:
| id | title    | status | created             | updated             |
|----+----------+--------+---------------------+---------------------|
|  1 | 買い物   |      1 | 2020-05-06 14:52:33 | 2020-05-06 14:52:33 |
|  3 | 料理     |      0 | 2020-05-06 14:53:09 | 2020-05-06 14:53:09 |
|  4 | 粗大ゴミ |      0 | 2020-05-06 14:53:09 | 2020-05-06 14:53:09 |
